source/blog/2014-11-26-bulletjournal-updates.org
#+TITLE: BulletJournal Updates
#+DATE: 2014-11-26
#+HUGO_BASE_DIR: ../hugo-site/
#+HUGO_SECTION: posts
#+HUGO_TAGS: journal
I have been using Ryder Carroll's [[http://www.bulletjournal.com][BulletJournal]] techniques for
organizing my analog journal for about 6 months now.  There are
several things I really like about this system.

- It is easy to maintain
- It lets you carry around just /one/ paper journal that you can use
  for everything; e.g., to-do lists, project notes, work and activity
  tracking, study notes, etc.
- It is very easy to customize to fit your needs.

Regarding that last point, I would like to share my current setup.

{{{more}}}

* Pages
** Main Index (one full spread)

- Page Title: ~Index <from-date>-<to-date>~
- Entries for
  - Monthly calendars
  - Collections
- Page numbers recorded on right side

** Recurring Tasks (one full spread)

- Page Title: ~Recurring Tasks~

** Future Tasks (one full spread)

- Page Title: ~Future Tasks~

** Monthly Calendar/Tasks (two spreads, if necessary)

- Page Title: ~yyyy-mm (month)~
- Left two columns for every other row (two rows per day. if necessary
  carry-over to second spread)
  - day (1-31)
  - two letters of weekday; e.g., 'Mo' for Monday, etc.
- Right side of first row for each day
  - Page number for the start of the Daily Calendar for that day
- Entries 
  - enter significant events on that day
  - appointments
  - task references
- Monthly tasks are listed following last day of month
  - Enter TODO items for the month (see Bullets below)
  - Include day numbers or weekday names in square brackets
  - Examples:
	- @E ☐ TODO [WE] Flowers For Mikie
	- @H ☐ TODO [1, 15] Vacuum the cats

** Daily Calendar

- Title: ~yyyy-mm-dd (day)~
- Entries: See Bullets below

** Collections

- Title: Whatever is appropriate for the collection
- Entries: See Bullets below

** Continuation Markers

- Used if Index, Calendar, or Collection fills up page and has to carry to
  another page
- Add ~--> <new-page-number>~ at top of original page (by title)
- Add ~<-- <old-page-number>~ at top of new page (by title)

** Bullets

- These are used to mark the type of entry that follows
  - ◯ event entry
  - ☐ TODO entry
	- Leave two grids on left of marker for GTD contexts:
	  - @A - Anywhere
	  - @C - Computer
	  - @E - Errand
	  - @H - Home
	  - @M - Meeting (Agenda)
	  - @O - Office
	  - @P - Phone
	  - @S - Someday/Maybe
	  - @W - Waiting-For
	- Include optional due date by including [DD=mm/dd]
  - \middot General Note entry
  - >> Journal entry
  - \darr Check-In (at a location)
  - \uarr Check-Out (from a location)
  - Other entries:
	- (A) Audio entry (music, podcast, audiobook)
	- (B) Book Notes	  
	- (C) C3 - Caring, Connecting, Committing
	- (D) Drink entry (water, coffee, wine, etc)
	- (E) Exercise entry (cardio, resistance, stretching, etc.)
	- (F) Food log entry (breakfast, lunch, dinner, snack)
	- (I) Idea for project
	- (L) Learning (language, math, etc)
	- (M) Measurement entry (weight, blood pressure, resting heart
      rate, sleep, etc.)
	- (N) News
	- (P) Pen/Ink/Paper related note
	- (S) Supplements/Medicine
	- (R) Relaxation (meditation)
	- (W) Weather entry


* Procedures
** Starting New Month

- Initialize full-spread /monthly calendar/ and full-spread /monthly tasks/.
- Carry over unfinished tasks from previous month
- Scan /recurring tasks/ and write them in on new /monthly calendar/
  or /monthly tasks/
- Scan /future tasks/ and write them in on new /monthly calendar/ or
  /monthly tasks/.

** Starting New Day

- Initialize /daily calendar/
- Carry over unfinished tasks from previous day
- Write in any appropriate tasks or appointments from /monthly
  calendar/ and /monthly tasks/

