source/hugo-site/content/posts/2014-11-26-bulletjournal-updates.md
+++
title = "BulletJournal Updates"
author = ["Gordon Tillman"]
date = 2014-11-26
tags = ["journal"]
draft = false
+++

I have been using Ryder Carroll's [BulletJournal](http://www.bulletjournal.com) techniques for
organizing my analog journal for about 6 months now.  There are
several things I really like about this system.

-   It is easy to maintain
-   It lets you carry around just _one_ paper journal that you can use
    for everything; e.g., to-do lists, project notes, work and activity
    tracking, study notes, etc.
-   It is very easy to customize to fit your needs.

Regarding that last point, I would like to share my current setup.

<!--more-->


## Pages {#pages}


### Main Index (one full spread) {#main-index--one-full-spread}

-   Page Title: `Index <from-date>-<to-date>`
-   Entries for
    -   Monthly calendars
    -   Collections
-   Page numbers recorded on right side


### Recurring Tasks (one full spread) {#recurring-tasks--one-full-spread}

-   Page Title: `Recurring Tasks`


### Future Tasks (one full spread) {#future-tasks--one-full-spread}

-   Page Title: `Future Tasks`


### Monthly Calendar/Tasks (two spreads, if necessary) {#monthly-calendar-tasks--two-spreads-if-necessary}

-   Page Title: `yyyy-mm (month)`
-   Left two columns for every other row (two rows per day. if necessary
    carry-over to second spread)
    -   day (1-31)
    -   two letters of weekday; e.g., 'Mo' for Monday, etc.
-   Right side of first row for each day
    -   Page number for the start of the Daily Calendar for that day
-   Entries
    -   enter significant events on that day
    -   appointments
    -   task references
-   Monthly tasks are listed following last day of month
    -   Enter TODO items for the month (see Bullets below)
    -   Include day numbers or weekday names in square brackets
    -   Examples:
        -   @E ☐ TODO [WE] Flowers For Mikie
        -   @H ☐ TODO [1, 15] Vacuum the cats


### Daily Calendar {#daily-calendar}

-   Title: `yyyy-mm-dd (day)`
-   Entries: See Bullets below


### Collections {#collections}

-   Title: Whatever is appropriate for the collection
-   Entries: See Bullets below


### Continuation Markers {#continuation-markers}

-   Used if Index, Calendar, or Collection fills up page and has to carry to
    another page
-   Add `--> <new-page-number>` at top of original page (by title)
-   Add `<-- <old-page-number>` at top of new page (by title)


### Bullets {#bullets}

-   These are used to mark the type of entry that follows
    -   ◯ event entry
    -   ☐ TODO entry
        -   Leave two grids on left of marker for GTD contexts:
            -   @A - Anywhere
            -   @C - Computer
            -   @E - Errand
            -   @H - Home
            -   @M - Meeting (Agenda)
            -   @O - Office
            -   @P - Phone
            -   @S - Someday/Maybe
            -   @W - Waiting-For
        -   Include optional due date by including [DD=mm/dd]
    -   &middot; General Note entry
    -   &gt;&gt; Journal entry
    -   &darr; Check-In (at a location)
    -   &uarr; Check-Out (from a location)
    -   Other entries:

        -   (A) Audio entry (music, podcast, audiobook)
        -   (B) Book Notes
        -   (C) C3 - Caring, Connecting, Committing
        -   (D) Drink entry (water, coffee, wine, etc)
        -   (E) Exercise entry (cardio, resistance, stretching, etc.)
        -   (F) Food log entry (breakfast, lunch, dinner, snack)
        -   (I) Idea for project
        -   (L) Learning (language, math, etc)
        -   (M) Measurement entry (weight, blood pressure, resting heart

        rate, sleep, etc.)

        -   (N) News
        -   (P) Pen/Ink/Paper related note
        -   (S) Supplements/Medicine
        -   (R) Relaxation (meditation)
        -   (W) Weather entry


## Procedures {#procedures}


### Starting New Month {#starting-new-month}

-   Initialize full-spread _monthly calendar_ and full-spread _monthly tasks_.
-   Carry over unfinished tasks from previous month
-   Scan _recurring tasks_ and write them in on new _monthly calendar_
    or _monthly tasks_
-   Scan _future tasks_ and write them in on new _monthly calendar_ or
    _monthly tasks_.


### Starting New Day {#starting-new-day}

-   Initialize _daily calendar_
-   Carry over unfinished tasks from previous day
-   Write in any appropriate tasks or appointments from _monthly
    calendar_ and _monthly tasks_
